
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |          44 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                      |
|:--------:|:-----------------------------------------------------------------------------------------------|
|    🟡    | `module.release_infrahouse_com["focal"].aws_acm_certificate.repo`                              |
|    🟡    | `module.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo`                      |
|    🟡    | `module.release_infrahouse_com["focal"].aws_s3_bucket.repo`                                    |
|    🟡    | `module.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs`                               |
|    🟡    | `module.release_infrahouse_com["focal"].aws_s3_bucket_policy.bucket-access`                    |
|    🟡    | `module.release_infrahouse_com["focal"].aws_s3_bucket_policy.repo-logs`                        |
|    🟡    | `module.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key`                      |
|    🟡    | `module.release_infrahouse_com["focal"].aws_s3_object.distributions`                           |
|    🟡    | `module.release_infrahouse_com["focal"].aws_s3_object.index-html`                              |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_acm_certificate.repo`                              |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo`                      |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_s3_bucket.repo`                                    |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs`                               |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_s3_bucket_policy.bucket-access`                    |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_s3_bucket_policy.repo-logs`                        |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key`                      |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_s3_object.distributions`                           |
|    🟡    | `module.release_infrahouse_com["jammy"].aws_s3_object.index-html`                              |
|    🟡    | `module.release_infrahouse_com["noble"].aws_acm_certificate.repo`                              |
|    🟡    | `module.release_infrahouse_com["noble"].aws_cloudfront_distribution.repo`                      |
|    🟡    | `module.release_infrahouse_com["noble"].aws_s3_bucket.repo`                                    |
|    🟡    | `module.release_infrahouse_com["noble"].aws_s3_bucket.repo-logs`                               |
|    🟡    | `module.release_infrahouse_com["noble"].aws_s3_bucket_policy.bucket-access`                    |
|    🟡    | `module.release_infrahouse_com["noble"].aws_s3_bucket_policy.repo-logs`                        |
|    🟡    | `module.release_infrahouse_com["noble"].aws_s3_object.deb-gpg-public-key`                      |
|    🟡    | `module.release_infrahouse_com["noble"].aws_s3_object.distributions`                           |
|    🟡    | `module.release_infrahouse_com["noble"].aws_s3_object.index-html`                              |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_acm_certificate.repo`                           |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_cloudfront_distribution.repo`                   |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_s3_bucket.repo`                                 |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_s3_bucket.repo-logs`                            |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_s3_bucket_policy.bucket-access`                 |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_s3_bucket_policy.repo-logs`                     |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_s3_object.deb-gpg-public-key`                   |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_s3_object.distributions`                        |
|    🟡    | `module.release_infrahouse_com["oracular"].aws_s3_object.index-html`                           |
|    🟡    | `module.release_infrahouse_com["focal"].module.key.aws_secretsmanager_secret.secret`           |
|    🟡    | `module.release_infrahouse_com["focal"].module.passphrase.aws_secretsmanager_secret.secret`    |
|    🟡    | `module.release_infrahouse_com["jammy"].module.key.aws_secretsmanager_secret.secret`           |
|    🟡    | `module.release_infrahouse_com["jammy"].module.passphrase.aws_secretsmanager_secret.secret`    |
|    🟡    | `module.release_infrahouse_com["noble"].module.key.aws_secretsmanager_secret.secret`           |
|    🟡    | `module.release_infrahouse_com["noble"].module.passphrase.aws_secretsmanager_secret.secret`    |
|    🟡    | `module.release_infrahouse_com["oracular"].module.key.aws_secretsmanager_secret.secret`        |
|    🟡    | `module.release_infrahouse_com["oracular"].module.passphrase.aws_secretsmanager_secret.secret` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket-access" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-focal/*",
                              + "arn:aws:s3:::infrahouse-release-focal",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-focal/*",
                              + "arn:aws:s3:::infrahouse-release-focal",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-focal/*",
                              + "arn:aws:s3:::infrahouse-release-focal",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-focal/*",
                              + "arn:aws:s3:::infrahouse-release-focal",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-focal/*",
                              + "arn:aws:s3:::infrahouse-release-focal",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-focal/*",
                              + "arn:aws:s3:::infrahouse-release-focal",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-focal/*",
                              + "arn:aws:s3:::infrahouse-release-focal",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-cloudfront-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bucket-cloudfront-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-focal/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::493370826424:distribution/E161QGCPE3JIOK",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.release_infrahouse_com["focal"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-focal",
              + "arn:aws:s3:::infrahouse-release-focal/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["focal"].data.aws_iam_policy_document.repo-logs-enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "repo-logs-enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-focal-logs",
              + "arn:aws:s3:::infrahouse-release-focal-logs/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["focal"].aws_acm_certificate.repo will be updated in-place
  ~ resource "aws_acm_certificate" "repo" {
        id                        = "arn:aws:acm:us-east-1:493370826424:certificate/2eed53d3-e1ad-4743-ace5-89c193cd3c65"
      ~ tags                      = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-focal"
        }
      ~ tags_all                  = {
          + "service"           = "debian-repo-focal"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo will be updated in-place
  ~ resource "aws_cloudfront_distribution" "repo" {
        id                              = "E161QGCPE3JIOK"
      ~ tags                            = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-focal"
        }
      ~ tags_all                        = {
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-focal"
            # (3 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_bucket.repo will be updated in-place
  ~ resource "aws_s3_bucket" "repo" {
        id                          = "infrahouse-release-focal"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-focal"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-focal"
            # (3 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket" "repo-logs" {
        id                          = "infrahouse-release-focal-logs"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-focal"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-focal"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_bucket_policy.bucket-access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket-access" {
        id     = "infrahouse-release-focal"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::493370826424:distribution/E161QGCPE3JIOK"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::infrahouse-release-focal/*"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal/*",
                          - "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_bucket_policy.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket_policy" "repo-logs" {
        id     = "infrahouse-release-focal-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-focal-logs/*",
                          - "arn:aws:s3:::infrahouse-release-focal-logs",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key will be updated in-place
  ~ resource "aws_s3_object" "deb-gpg-public-key" {
        id                            = "DEB-GPG-KEY-release-focal.infrahouse.com"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-focal"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-focal"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_object.distributions will be updated in-place
  ~ resource "aws_s3_object" "distributions" {
        id                            = "conf/distributions"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-focal"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-focal"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_object.index-html will be updated in-place
  ~ resource "aws_s3_object" "index-html" {
        id                            = "index.html"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-focal"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-focal"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket-access" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-jammy/*",
                              + "arn:aws:s3:::infrahouse-release-jammy",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-jammy/*",
                              + "arn:aws:s3:::infrahouse-release-jammy",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-jammy/*",
                              + "arn:aws:s3:::infrahouse-release-jammy",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-jammy/*",
                              + "arn:aws:s3:::infrahouse-release-jammy",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-jammy/*",
                              + "arn:aws:s3:::infrahouse-release-jammy",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-jammy/*",
                              + "arn:aws:s3:::infrahouse-release-jammy",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-jammy/*",
                              + "arn:aws:s3:::infrahouse-release-jammy",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-cloudfront-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bucket-cloudfront-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-jammy/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::493370826424:distribution/E1IILWIY0OU78B",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.release_infrahouse_com["jammy"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-jammy",
              + "arn:aws:s3:::infrahouse-release-jammy/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["jammy"].data.aws_iam_policy_document.repo-logs-enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "repo-logs-enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-jammy-logs",
              + "arn:aws:s3:::infrahouse-release-jammy-logs/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["jammy"].aws_acm_certificate.repo will be updated in-place
  ~ resource "aws_acm_certificate" "repo" {
        id                        = "arn:aws:acm:us-east-1:493370826424:certificate/402852e1-7054-4cea-80ac-3ccbee72a398"
      ~ tags                      = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-jammy"
        }
      ~ tags_all                  = {
          + "service"           = "debian-repo-jammy"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo will be updated in-place
  ~ resource "aws_cloudfront_distribution" "repo" {
        id                              = "E1IILWIY0OU78B"
      ~ tags                            = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-jammy"
        }
      ~ tags_all                        = {
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-jammy"
            # (3 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_bucket.repo will be updated in-place
  ~ resource "aws_s3_bucket" "repo" {
        id                          = "infrahouse-release-jammy"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-jammy"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-jammy"
            # (3 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket" "repo-logs" {
        id                          = "infrahouse-release-jammy-logs"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-jammy"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-jammy"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_bucket_policy.bucket-access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket-access" {
        id     = "infrahouse-release-jammy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::493370826424:distribution/E1IILWIY0OU78B"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::infrahouse-release-jammy/*"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy/*",
                          - "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_bucket_policy.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket_policy" "repo-logs" {
        id     = "infrahouse-release-jammy-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-jammy-logs/*",
                          - "arn:aws:s3:::infrahouse-release-jammy-logs",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key will be updated in-place
  ~ resource "aws_s3_object" "deb-gpg-public-key" {
        id                            = "DEB-GPG-KEY-release-jammy.infrahouse.com"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-jammy"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-jammy"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_object.distributions will be updated in-place
  ~ resource "aws_s3_object" "distributions" {
        id                            = "conf/distributions"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-jammy"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-jammy"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_object.index-html will be updated in-place
  ~ resource "aws_s3_object" "index-html" {
        id                            = "index.html"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-jammy"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-jammy"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["noble"].data.aws_iam_policy_document.bucket-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket-access" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.release_infrahouse_com["noble"].data.aws_iam_policy_document.bucket-cloudfront-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bucket-cloudfront-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-noble/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::493370826424:distribution/E3CP2ZJ74UZV0M",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.release_infrahouse_com["noble"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-noble",
              + "arn:aws:s3:::infrahouse-release-noble/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["noble"].data.aws_iam_policy_document.repo-logs-enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "repo-logs-enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-noble-logs",
              + "arn:aws:s3:::infrahouse-release-noble-logs/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["noble"].aws_acm_certificate.repo will be updated in-place
  ~ resource "aws_acm_certificate" "repo" {
        id                        = "arn:aws:acm:us-east-1:493370826424:certificate/274aa980-a0e2-48ed-bb81-389dbe7ef556"
      ~ tags                      = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-noble"
        }
      ~ tags_all                  = {
          + "service"           = "debian-repo-noble"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.release_infrahouse_com["noble"].aws_cloudfront_distribution.repo will be updated in-place
  ~ resource "aws_cloudfront_distribution" "repo" {
        id                              = "E3CP2ZJ74UZV0M"
      ~ tags                            = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-noble"
        }
      ~ tags_all                        = {
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-noble"
            # (3 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket.repo will be updated in-place
  ~ resource "aws_s3_bucket" "repo" {
        id                          = "infrahouse-release-noble"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-noble"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-noble"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket" "repo-logs" {
        id                          = "infrahouse-release-noble-logs"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-noble"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-noble"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_policy.bucket-access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket-access" {
        id     = "infrahouse-release-noble"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::493370826424:distribution/E3CP2ZJ74UZV0M"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::infrahouse-release-noble/*"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble/*",
                          - "arn:aws:s3:::infrahouse-release-noble",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_policy.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket_policy" "repo-logs" {
        id     = "infrahouse-release-noble-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-noble-logs/*",
                          - "arn:aws:s3:::infrahouse-release-noble-logs",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["noble"].aws_s3_object.deb-gpg-public-key will be updated in-place
  ~ resource "aws_s3_object" "deb-gpg-public-key" {
        id                            = "DEB-GPG-KEY-release-noble.infrahouse.com"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-noble"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-noble"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["noble"].aws_s3_object.distributions will be updated in-place
  ~ resource "aws_s3_object" "distributions" {
        id                            = "conf/distributions"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-noble"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-noble"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["noble"].aws_s3_object.index-html will be updated in-place
  ~ resource "aws_s3_object" "index-html" {
        id                            = "index.html"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-noble"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-noble"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["oracular"].data.aws_iam_policy_document.bucket-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket-access" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-oracular/*",
                              + "arn:aws:s3:::infrahouse-release-oracular",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-oracular/*",
                              + "arn:aws:s3:::infrahouse-release-oracular",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-oracular/*",
                              + "arn:aws:s3:::infrahouse-release-oracular",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-oracular/*",
                              + "arn:aws:s3:::infrahouse-release-oracular",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-oracular/*",
                              + "arn:aws:s3:::infrahouse-release-oracular",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-oracular/*",
                              + "arn:aws:s3:::infrahouse-release-oracular",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-oracular/*",
                              + "arn:aws:s3:::infrahouse-release-oracular",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.release_infrahouse_com["oracular"].data.aws_iam_policy_document.bucket-cloudfront-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bucket-cloudfront-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-oracular/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::493370826424:distribution/EPN3OMIYXJCQ8",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.release_infrahouse_com["oracular"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-oracular",
              + "arn:aws:s3:::infrahouse-release-oracular/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["oracular"].data.aws_iam_policy_document.repo-logs-enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "repo-logs-enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-release-oracular-logs",
              + "arn:aws:s3:::infrahouse-release-oracular-logs/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.release_infrahouse_com["oracular"].aws_acm_certificate.repo will be updated in-place
  ~ resource "aws_acm_certificate" "repo" {
        id                        = "arn:aws:acm:us-east-1:493370826424:certificate/1e26a3eb-d187-4c96-96f3-0cc99725b4d9"
      ~ tags                      = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-oracular"
        }
      ~ tags_all                  = {
          + "service"           = "debian-repo-oracular"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_cloudfront_distribution.repo will be updated in-place
  ~ resource "aws_cloudfront_distribution" "repo" {
        id                              = "EPN3OMIYXJCQ8"
      ~ tags                            = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-oracular"
        }
      ~ tags_all                        = {
          + "module_version"    = "3.0.1"
          + "service"           = "debian-repo-oracular"
            # (3 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_s3_bucket.repo will be updated in-place
  ~ resource "aws_s3_bucket" "repo" {
        id                          = "infrahouse-release-oracular"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-oracular"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-oracular"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_s3_bucket.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket" "repo-logs" {
        id                          = "infrahouse-release-oracular-logs"
      ~ tags                        = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-oracular"
        }
      ~ tags_all                    = {
          + "service"           = "debian-repo-oracular"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_s3_bucket_policy.bucket-access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket-access" {
        id     = "infrahouse-release-oracular"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::493370826424:distribution/EPN3OMIYXJCQ8"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::infrahouse-release-oracular/*"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/infrahouse-com-github"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular/*",
                          - "arn:aws:s3:::infrahouse-release-oracular",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_s3_bucket_policy.repo-logs will be updated in-place
  ~ resource "aws_s3_bucket_policy" "repo-logs" {
        id     = "infrahouse-release-oracular-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-release-oracular-logs/*",
                          - "arn:aws:s3:::infrahouse-release-oracular-logs",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_s3_object.deb-gpg-public-key will be updated in-place
  ~ resource "aws_s3_object" "deb-gpg-public-key" {
        id                            = "DEB-GPG-KEY-release-oracular.infrahouse.com"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-oracular"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-oracular"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_s3_object.distributions will be updated in-place
  ~ resource "aws_s3_object" "distributions" {
        id                            = "conf/distributions"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-oracular"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-oracular"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["oracular"].aws_s3_object.index-html will be updated in-place
  ~ resource "aws_s3_object" "index-html" {
        id                            = "index.html"
      ~ tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "service"           = "debian-repo-oracular"
        }
      ~ tags_all                      = {
          + "service"           = "debian-repo-oracular"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].module.key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["focal"].module.key.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP"
        name                           = "packager-key-focal"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].module.passphrase.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.passphrase/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["focal"].module.passphrase.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq"
        name                           = "packager-passphrase-focal"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].module.key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["jammy"].module.key.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP"
        name                           = "packager-key-jammy"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].module.passphrase.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.passphrase/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["jammy"].module.passphrase.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG"
        name                           = "packager-passphrase-jammy"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["noble"].module.key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-noble-FvoeWe",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["noble"].module.key.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-noble-FvoeWe"
        name                           = "packager-key-noble"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["noble"].module.passphrase.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.passphrase/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["noble"].module.passphrase.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd"
        name                           = "packager-passphrase-noble"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["oracular"].module.key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-oracular-gxDJjw",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["oracular"].module.key.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-oracular-gxDJjw"
        name                           = "packager-key-oracular"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["oracular"].module.passphrase.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.passphrase/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-oracular-nSQf1H",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["oracular"].module.passphrase.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-oracular-nSQf1H"
        name                           = "packager-passphrase-oracular"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50" -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                              - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                              - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                            ] -> "*"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          + ArnNotLike    = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  + "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  + "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                          - StringNotLike = {
                              - "aws:PrincipalArn" = [
                                  - "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  - "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github",
                                  - "arn:aws:iam::493370826424:role/ih-tf-osv-scanner-github",
                                  - "arn:aws:iam::493370826424:role/infrahouse-com-github",
                                  - "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags                           = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          ~ "created_by_module" = "infrahouse/debian-repo/aws" -> "infrahouse/secret/aws"
          + "module_version"    = "1.0.3"
          + "service"           = "unknown"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 44 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiA0NCwgImRlc3Ryb3kiOiAwfX0=
```
</details>